.data
.text
	#测试ori指令
	#第三个立即数是无符号扩展，不存在负数的情况
	ori $a0, $0, 123		#测试与0进行or运算0|0111_1011=0111_1011
	ori $a1, $a0, 456		#测试两个非0数的or运算0111_1011|1_1100_1000=1_1111_1011
	
	#测试lui指令
	lui $a2, 123			#测试，构造正数0111_1011_0000_0000_0000_0000
	lui $a3, 0xffff			#测试，构造负数0xffff0000
	
	#测试addu指令
	#无符号相加，不存在负数情况
	addu $s0, $a0, $a2		#测试正数相加0111_1011+0111_1011_0000_0000_0000_0000=?0111_1011_0000_0000_0111_1011
	
	#测试subu指令
	#无符号相减，不存在负数情况
	subu $s1, $a2, $a0		#测试正数相减0111_1011_0000_0000_0000_0000-0111_1011=111_1010_1111_1111_1000_0101
	
	#测试sw指令
	ori $t0, $t0, 0x0000		#构造0
	sw $a0, 0($t0)			#测试0111_1011存入内存
	sw $a1, 4($t0)			#测试1_1111_1011存入内存
	
	#测试lw指令
	lw $s0, 0($t0)			#测试内存里数0111_1011写入寄存器
	lw $s1, 4($t0)			#测试内存里数1_1111_1011写入寄存器
	
	#测试beq指令
	ori $a0, $0, 1			#构造1
	ori $a1, $0, 2			#构造2
	ori $a2, $0, 1			#构造1
	beq $a0, $a1, loop1		#测试不跳转
	nop
	beq $a0, $a2, loop2		#测试跳转
	nop

loop1:ori $a0, $0, 0
loop2:ori $a1, $0, 0
	
	
